I have updated with the suggested version 1.3 and the output was that

# leverage terraform commands

# leverage terraform init

[15:29:33.708] INFO     Checking environment name definition in account.tfvars...                               
[15:29:33.712] INFO     ✔ OK                                                                                    
                                                                                                                
[15:29:33.714] INFO     Checking backend key...                                                                 
[15:29:33.715] INFO     Found: 'apps-devstg/network/terraform.tfstate'                                          
[15:29:33.716] INFO     ✔ OK                                                                                    
                                                                                                                
[15:29:33.719] INFO     Checking backend.tfvars:                                                                
                                                                                                                
[15:29:33.720] INFO     Checking if profile starts with bb-apps-devstg...                                       
[15:29:33.722] INFO     ✔ OK                                                                                    
                                                                                                                
[15:29:33.725] INFO     Checking if bucket starts with bb-apps-devstg...                                        
[15:29:33.727] INFO     ✔ OK                                                                                    
                                                                                                                
[15:29:33.729] INFO     Checking if dynamodb table starts with bb-apps-devstg...                                
[15:29:33.731] INFO     ✔ OK                                                                                    
                                                                                                                
[18:29:39]    INFO      Attempting to get temporary credentials for apps-devstg account.
[18:29:48]    INFO      Credentials for apps-devstg account written successfully.
[18:29:48]    INFO      Attempting to get temporary credentials for network account.
[18:29:57]    INFO      Credentials for network account written successfully.
[18:29:57]    INFO      Attempting to get temporary credentials for shared account.
[18:30:05]    INFO      Credentials for shared account written successfully.
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v4.61.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

## leverage terraform plan

[18:30:29]    INFO      Attempting to get temporary credentials for apps-devstg account.
[18:30:31]    INFO      Using already configured temporary credentials.
[18:30:31]    INFO      Attempting to get temporary credentials for network account.
[18:30:32]    INFO      Using already configured temporary credentials.
[18:30:32]    INFO      Attempting to get temporary credentials for shared account.
[18:30:34]    INFO      Using already configured temporary credentials.
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.network-vpcs["network-firewall"]: Reading...
data.terraform_remote_state.notifications: Reading...
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-base"]: Reading...
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-k8s-eks"]: Reading...
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-k8s-eks-v117"]: Reading...
data.terraform_remote_state.network-vpcs["network-base"]: Reading...
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-k8s-eks-demoapps"]: Reading...
data.terraform_remote_state.tools-vpn-server: Reading...
data.terraform_remote_state.shared-vpcs["shared-base"]: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_region.this: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_region.this: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_region.this: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_region.this: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_region.this: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_region.this: Read complete after 0s [id=us-east-1]
module.vpc_flow_logs.aws_s3_bucket.this: Refreshing state... [id=bb-apps-devstg-vpc-flowlogs]
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-k8s-eks"]: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_caller_identity.peer: Reading...
data.terraform_remote_state.notifications: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_caller_identity.peer: Reading...
data.terraform_remote_state.network-vpcs["network-firewall"]: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_caller_identity.peer: Reading...
data.terraform_remote_state.tools-vpn-server: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_caller_identity.this: Reading...
data.terraform_remote_state.network-vpcs["network-base"]: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_caller_identity.this: Reading...
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-k8s-eks-demoapps"]: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_caller_identity.this: Reading...
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-base"]: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_region.peer: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_region.peer: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_region.peer: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_region.peer: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_region.peer: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_region.peer: Read complete after 0s [id=us-east-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-072f329fed6757e95]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_caller_identity.peer: Read complete after 0s [id=523857393444]
module.vpc-natgw-notifications.data.aws_sns_topic.main: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_caller_identity.peer: Read complete after 0s [id=523857393444]
data.terraform_remote_state.shared-vpcs["shared-base"]: Read complete after 2s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_caller_identity.peer: Read complete after 0s [id=523857393444]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_caller_identity.this: Read complete after 0s [id=523857393444]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_caller_identity.this: Read complete after 1s [id=523857393444]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_caller_identity.this: Read complete after 1s [id=523857393444]
data.terraform_remote_state.apps-devstg-vpcs["apps-devstg-k8s-eks-v117"]: Read complete after 3s
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_vpc.peer_vpc: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_vpc.peer_vpc: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_route_tables.peer_vpc_rts: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_route_tables.peer_vpc_rts: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_route_tables.peer_vpc_rts: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_vpc.peer_vpc: Reading...
module.vpc-natgw-notifications.data.aws_sns_topic.main: Read complete after 1s [id=arn:aws:sns:us-east-1:523857393444:sns-topic-slack-notify-monitoring]
module.vpc-natgw-notifications.aws_cloudwatch_metric_alarm.alarm_cw_natgw_active_cx[0]: Refreshing state... [id=vpc-natgw-active-cx-count-alarm-apps-devstg-account]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_route_tables.peer_vpc_rts: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_route_tables.peer_vpc_rts: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_route_tables.peer_vpc_rts: Read complete after 0s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_vpc.peer_vpc: Read complete after 1s [id=vpc-0e0c2d74886745b8e]
module.vpc_flow_logs.data.aws_iam_policy_document.allow_vpc_flowlogs_delivery_service[0]: Reading...
module.vpc_flow_logs.aws_s3_bucket_public_access_block.default: Refreshing state... [id=bb-apps-devstg-vpc-flowlogs]
module.vpc_flow_logs.data.aws_iam_policy_document.ssl_enforce[0]: Reading...
module.vpc_flow_logs.data.aws_iam_policy_document.allow_vpc_flowlogs_delivery_service[0]: Read complete after 0s [id=2061517329]
module.vpc_flow_logs.data.aws_iam_policy_document.ssl_enforce[0]: Read complete after 0s [id=2374437209]
module.vpc_flow_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.vpc_flow_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2085034975]
module.vpc_flow_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=bb-apps-devstg-vpc-flowlogs]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_vpc.peer_vpc: Read complete after 1s [id=vpc-01d6b54ae12f823aa]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_vpc.peer_vpc: Read complete after 1s [id=vpc-068257760d7e3f944]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_route_tables.this_vpc_rts: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_route_tables.this_vpc_rts: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_route_tables.this_vpc_rts: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_vpc_peering_connection.this: Refreshing state... [id=pcx-00fcac2814cabd751]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_vpc_peering_connection.this: Refreshing state... [id=pcx-01fb33dee8ff12ec1]
module.vpc_flow_logs.aws_flow_log.this: Refreshing state... [id=fl-0886b100a47e73186]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_vpc_peering_connection.this: Refreshing state... [id=pcx-0e9fbd66040187cba]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05d75d908f61d35e5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-094c287defbc07180]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_vpc.this_vpc: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_route_tables.this_vpc_rts: Read complete after 1s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_route_tables.this_vpc_rts: Read complete after 1s [id=us-east-1]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0cec521de70ee76a3]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_vpc.this_vpc: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_route_tables.this_vpc_rts: Read complete after 1s [id=us-east-1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_vpc.this_vpc: Reading...
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0037275ed5f8d18f4]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0923da71d5640916a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb0ddcc1aaece2c4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d218f8cfd48fcddd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-021c484ecfbba66a9]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-012079901076c3d0b]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_vpc_peering_connection_accepter.peer_accepter: Refreshing state... [id=pcx-0e9fbd66040187cba]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_vpc_peering_connection_accepter.peer_accepter: Refreshing state... [id=pcx-00fcac2814cabd751]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_vpc_peering_connection_accepter.peer_accepter: Refreshing state... [id=pcx-01fb33dee8ff12ec1]
module.vpc.aws_network_acl.private[0]: Refreshing state... [id=acl-0ae4b0f6f91a271be]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0923da71d5640916a1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0869e24d74c510740]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09441e27cc9b7d0d3]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab2b3362da34b7ea]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a0224a5f36b0007a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-019d84087922ea6db]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0978630cbada98de8]
module.vpc.aws_network_acl.public[0]: Refreshing state... [id=acl-0412f785dc73e4ac9]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_vpc_peering_connection_options.accepter: Refreshing state... [id=pcx-01fb33dee8ff12ec1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_vpc_peering_connection_options.accepter: Refreshing state... [id=pcx-0e9fbd66040187cba]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_vpc_peering_connection_options.accepter: Refreshing state... [id=pcx-00fcac2814cabd751]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_vpc_peering_connection_options.this: Refreshing state... [id=pcx-01fb33dee8ff12ec1]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_vpc_peering_connection_options.this: Refreshing state... [id=pcx-00fcac2814cabd751]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_vpc_peering_connection_options.this: Refreshing state... [id=pcx-0e9fbd66040187cba]
module.vpc.aws_network_acl_rule.private_inbound[0]: Refreshing state... [id=nacl-2124046043]
module.vpc.aws_network_acl_rule.private_inbound[5]: Refreshing state... [id=nacl-2883193492]
module.vpc.aws_network_acl_rule.private_inbound[4]: Refreshing state... [id=nacl-1765809998]
module.vpc.aws_network_acl_rule.private_inbound[3]: Refreshing state... [id=nacl-153466667]
module.vpc.aws_network_acl_rule.private_inbound[1]: Refreshing state... [id=nacl-3818241965]
module.vpc.aws_network_acl_rule.private_inbound[2]: Refreshing state... [id=nacl-152873477]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].data.aws_vpc.this_vpc: Read complete after 2s [id=vpc-072f329fed6757e95]
module.vpc.aws_network_acl_rule.private_outbound[0]: Refreshing state... [id=nacl-677853148]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].data.aws_vpc.this_vpc: Read complete after 1s [id=vpc-072f329fed6757e95]
module.vpc.aws_network_acl_rule.public_outbound[0]: Refreshing state... [id=nacl-755457729]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].data.aws_vpc.this_vpc: Read complete after 1s [id=vpc-072f329fed6757e95]
module.vpc.aws_network_acl_rule.public_inbound[0]: Refreshing state... [id=nacl-3079681765]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.this_routes[0]: Refreshing state... [id=r-rtb-0923da71d5640916a1218385255]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.this_routes[1]: Refreshing state... [id=r-rtb-0bb0ddcc1aaece2c41218385255]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.this_routes[1]: Refreshing state... [id=r-rtb-0bb0ddcc1aaece2c43322942084]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.this_routes[0]: Refreshing state... [id=r-rtb-0923da71d5640916a3322942084]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_route.this_routes[0]: Refreshing state... [id=r-rtb-0923da71d5640916a179966490]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_route.this_routes[1]: Refreshing state... [id=r-rtb-0bb0ddcc1aaece2c4179966490]
module.vpc_endpoints["s3"].data.aws_vpc_endpoint_service.this["endpoint"]: Reading...
module.vpc_endpoints["dynamodb"].data.aws_vpc_endpoint_service.this["endpoint"]: Reading...
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.peer_routes[1]: Refreshing state... [id=r-rtb-04eaa3954c483fde23924809021]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.peer_routes[0]: Refreshing state... [id=r-rtb-02233ba0e8c3d94a33924809021]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_route.peer_routes[1]: Refreshing state... [id=r-rtb-0aaa33a4583dc8bba3924809021]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.peer_routes[1]: Refreshing state... [id=r-rtb-0286f74bc07028a0e3924809021]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-v117"].aws_route.peer_routes[0]: Refreshing state... [id=r-rtb-0a6e775ba40aa6d463924809021]
module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.peer_routes[0]: Refreshing state... [id=r-rtb-006fc2b7a8e0fd2123924809021]
module.vpc_endpoints["dynamodb"].data.aws_vpc_endpoint_service.this["endpoint"]: Read complete after 0s [id=2816157640]
module.vpc_endpoints["s3"].data.aws_vpc_endpoint_service.this["endpoint"]: Read complete after 0s [id=195798706]
module.vpc_endpoints["dynamodb"].aws_vpc_endpoint.this["endpoint"]: Refreshing state... [id=vpce-04b1cf44b4be040e2]
module.vpc_endpoints["s3"].aws_vpc_endpoint.this["endpoint"]: Refreshing state... [id=vpce-07427fafe5ccf2f1f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may
have affected this plan:

  # module.vpc_endpoints["s3"].aws_vpc_endpoint.this["endpoint"] has changed
  ~ resource "aws_vpc_endpoint" "this" {
      ~ cidr_blocks           = [
          + "16.182.0.0/16",
            "18.34.0.0/19",
            # (4 unchanged elements hidden)
        ]
        id                    = "vpce-07427fafe5ccf2f1f"
        tags                  = {
            "Environment" = "apps-devstg"
            "Terraform"   = "true"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.peer_routes[0] has been deleted
  - resource "aws_route" "peer_routes" {
      - destination_cidr_block    = "172.18.32.0/20" -> null
      - id                        = "r-rtb-006fc2b7a8e0fd2123924809021" -> null
      - origin                    = "CreateRoute" -> null
      - route_table_id            = "rtb-006fc2b7a8e0fd212" -> null
      - state                     = "active" -> null
      - vpc_peering_connection_id = "pcx-0e9fbd66040187cba" -> null
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.peer_routes[1] has been deleted
  - resource "aws_route" "peer_routes" {
      - destination_cidr_block    = "172.18.32.0/20" -> null
      - id                        = "r-rtb-04eaa3954c483fde23924809021" -> null
      - origin                    = "CreateRoute" -> null
      - route_table_id            = "rtb-04eaa3954c483fde2" -> null
      - state                     = "active" -> null
      - vpc_peering_connection_id = "pcx-0e9fbd66040187cba" -> null
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.peer_routes[0] has been deleted
  - resource "aws_route" "peer_routes" {
      - destination_cidr_block    = "172.18.32.0/20" -> null
      - id                        = "r-rtb-02233ba0e8c3d94a33924809021" -> null
      - origin                    = "CreateRoute" -> null
      - route_table_id            = "rtb-02233ba0e8c3d94a3" -> null
      - state                     = "active" -> null
      - vpc_peering_connection_id = "pcx-00fcac2814cabd751" -> null
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.peer_routes[1] has been deleted
  - resource "aws_route" "peer_routes" {
      - destination_cidr_block    = "172.18.32.0/20" -> null
      - id                        = "r-rtb-0286f74bc07028a0e3924809021" -> null
      - origin                    = "CreateRoute" -> null
      - route_table_id            = "rtb-0286f74bc07028a0e" -> null
      - state                     = "active" -> null
      - vpc_peering_connection_id = "pcx-00fcac2814cabd751" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using
ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc_flow_logs.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "bb-apps-devstg-vpc-flowlogs"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = [
                                  + "false",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-vpc-flowlogs/*"
                      + Sid       = "EnforceSSlRequestsOnly"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + "ForAnyValue:StringEquals" = {
                              + "s3:x-amz-acl" = [
                                  + "bucket-owner-full-control",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::bb-apps-devstg-vpc-flowlogs/*"
                      + Sid       = "AllowVpcFlowLogsDeliveryService"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.peer_routes[0] will be created
  + resource "aws_route" "peer_routes" {
      + destination_cidr_block    = "172.18.32.0/20"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0771f3ca13b0aede4"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0e9fbd66040187cba"
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks"].aws_route.peer_routes[1] will be created
  + resource "aws_route" "peer_routes" {
      + destination_cidr_block    = "172.18.32.0/20"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-08572730f76591f1e"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0e9fbd66040187cba"
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.peer_routes[0] will be created
  + resource "aws_route" "peer_routes" {
      + destination_cidr_block    = "172.18.32.0/20"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-02639424936ce7ea6"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-00fcac2814cabd751"
    }

  # module.vpc_peering_apps_devstg_to_eks_clusters["apps-devstg-k8s-eks-demoapps"].aws_route.peer_routes[1] will be created
  + resource "aws_route" "peer_routes" {
      + destination_cidr_block    = "172.18.32.0/20"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-076ba961b4cc90dce"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-00fcac2814cabd751"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with module.vpc_flow_logs.aws_s3_bucket.this,
│   on .terraform/modules/vpc_flow_logs/main.tf line 14, in resource "aws_s3_bucket" "this":
│   14: resource "aws_s3_bucket" "this" {
│ 
│ Use the aws_s3_bucket_lifecycle_configuration resource instead
│ 
│ (and 6 more similar warnings elsewhere)
╵

───────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these
actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

